Table of Contents
 Class IdeaStatiCaClient<T>
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
public class IdeaStatiCaClient<T> : ClientBase<T>, ICommunicationObject, IDisposable where T : class
Type Parameters
T
Inheritance
object
ClientBase<T>
IdeaStatiCaClient<T>
Implements
ICommunicationObject
IDisposable
Inherited Members
 ClientBase<T>.GetDefaultValueForInitialization<T>()
 ClientBase<T>.Open()
 ClientBase<T>.Abort()
 ClientBase<T>.Close()
 ClientBase<T>.DisplayInitializationUI()
 ClientBase<T>.CreateChannel()
 ClientBase<T>.InvokeAsync(ClientBase<T>.BeginOperationDelegate, object[], ClientBase<T>.EndOperationDelegate, SendOrPostCallback, object)
 ClientBase<T>.Channel
 ClientBase<T>.CacheSetting
 ClientBase<T>.ChannelFactory
 ClientBase<T>.ClientCredentials
 ClientBase<T>.State
 ClientBase<T>.InnerChannel
 ClientBase<T>.Endpoint
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaStatiCaClient(Binding, EndpointAddress)
public IdeaStatiCaClient(Binding binding, EndpointAddress remoteAddress)
Parameters
binding Binding
remoteAddress EndpointAddress
Properties
 Service
public T Service { get; }
Property Value
T
 Edit this page